// Задача 50. Напишите программу, которая будет принимать от пользователя позицию (M, N)
 // двумерного массива и возвращать значение элемента, стоящего в этой позиции. 
 // Если такой позиции в массиве нет, то сообщить об этом пользователю. 
 // Сгенерировать массив случайным образом. Размерность массива определить самостоятельно. 
// Использование методов для заполнения массива обязательно. Остальное можно реализовать в главной программе.

// Например, задан массив:

// 1 4 7 2

// 5 9 2 3

// 8 4 2 4

// M = 1, N = 7 -> В массиве отсутствует элемент в такой позиции.